Repository: twonlyapp/twonly-app
Catalog: lib/src/localization/app_*.arb
Languages: de

# registerTitle
source: Welcome to twonly!
de: Willkommen bei twonly!

# registerSlogan
source: twonly, a privacy friendly way to connect with friends through secure, spontaneous image sharing
de: twonly, eine private und sichere Möglichkeit um mit Freunden in Kontakt zu bleiben.

# onboardingWelcomeTitle
source: Welcome to twonly!
de: Willkommen bei twonly!

# onboardingWelcomeBody
source: Experience a private and secure way to stay in touch with friends by sharing instant pictures.
de: Erlebe eine private und sichere Möglichkeit mit Freunden in Kontakt zu bleiben, indem du spontane Bilder teilst.

# onboardingE2eTitle
source: Carefree sharing
de: Unbekümmert teilen

# onboardingE2eBody
source: With end-to-end encryption, enjoy the peace of mind that only you and your friends can see the moments you share.
de: Genieße durch die Ende-zu-Ende-Verschlüsselung die Gewissheit, dass nur du und deine Freunde die geteilten Momente sehen können.

# onboardingFocusTitle
source: Focus on sharing moments
de: Fokussiere dich auf das Teilen von Momenten

# onboardingFocusBody
source: Say goodbye to addictive features! twonly was created for sharing moments, free from useless distractions or ads.
de: Verabschiede dich von süchtig machenden Funktionen! twonly wurde für das Teilen von Momenten ohne nutzlose Ablenkungen oder Werbung entwickelt.

# onboardingSendTwonliesTitle
source: Send twonlies
de: twonlies senden

# onboardingSendTwonliesBody
source: Share moments securely with your partner. twonly ensures that only your partner can open it, keeping your moments with your partner a two(o)nly thing!
de: Teile Momente sicher mit deinem Partner. twonly stellt sicher, dass nur dein Partner sie öffnen kann, sodass deine Momente mit deinem Partner eine two(o)nly Sache bleiben!

# onboardingNotProductTitle
source: You are not the product!
de: Du bist nicht das Produkt!

# onboardingNotProductBody
source: twonly is financed by donations and an optional subscription. Your data will never be sold.
de: twonly wird durch Spenden und ein optionales Abonnement finanziert. Deine Daten werden niemals verkauft.

# onboardingBuyOneGetTwoTitle
source: Buy one get two
de: Kaufe eins, bekomme zwei

# onboardingBuyOneGetTwoBody
source: twonly always requires at least two people, which is why you receive a second free license for your twonly partner with your purchase.
de: twonly benötigt immer mindestens zwei Personen, daher erhältst du beim Kauf eine zweite kostenlose Lizenz für deinen twonly-Partner.

# onboardingGetStartedTitle
source: Let's go!
de: Auf geht's

# onboardingGetStartedBody
source: You can test twonly free of charge in preview mode. In this mode you can be found by others and receive pictures or videos but you cannot send any yourself.
de: Du kannst twonly kostenlos im Preview-Modus testen. In diesem Modus kannst du von anderen gefunden werden und Bilder oder Videos empfangen, aber du kannst selbst keine senden.

# onboardingTryForFree
source: Try for free
de: Jetzt registrieren

# registerUsernameSlogan
source: Please select a username so others can find you!
de: Bitte wähle einen Benutzernamen, damit dich andere finden können!

# registerUsernameDecoration
source: Username
de: Benutzername

# registerUsernameLimits
source: Your username must be at least 3 characters long.
de: Der Benutzername muss mindestens 3 Zeichen lang sein.

# registerSubmitButton
source: Register now!
de: Jetzt registrieren!

# registerTwonlyCodeText
source: Have you received a twonly code? Then redeem it either directly here or later!
de: Hast du einen twonly-Code erhalten? Dann löse ihn entweder direkt hier oder später ein!

# newMessageTitle
source: New message
de: Neue Nachricht

# chatsTapToSend
source: Click to send your first image
de: Klicke, um dein erstes Bild zu teilen.

# cameraPreviewSendTo
source: Send to
de: Senden an

# shareImageTitle
source: Share with
de: Teilen mit

# shareImageBestFriends
source: Best friends
de: Beste Freunde

# shareImagePinnedContacts
source: Pinnded
de: Angeheftet

# shareImagedEditorSendImage
source: Send
de: Senden

# shareImagedEditorShareWith
source: Share with
de: Teilen mit

# shareImagedEditorSaveImage
source: Save
de: Speichern

# shareImagedEditorSavedImage
source: Saved
de: Gespeichert

# shareImagedSelectAll
source: Select all
de: Alle auswählen

# shareImageAllUsers
source: All contacts
de: Alle Kontakte

# shareImageAllTwonlyWarning
source: twonlies can only be send to verified contacts!
de: twonlies können nur an verifizierte Kontakte gesendet werden!

# shareImageSearchAllContacts
source: Search all contacts
de: Alle Kontakte durchsuchen

# shareImageUserNotVerified
source: User is not verified
de: Benutzer ist nicht verifiziert

# shareImageUserNotVerifiedDesc
source: twonlies can only be sent to verified users. To verify a user, go to their profile and to verify security number.
de: twonlies können nur an verifizierte Nutzer gesendet werden. Um einen Nutzer zu verifizieren, gehe auf sein Profil und auf „Sicherheitsnummer verifizieren“.

# shareImageShowArchived
source: Show archived users
de: Archivierte Benutzer anzeigen

# searchUsernameInput
source: Username
de: Benutzername

# searchUsernameTitle
source: Search username
de: Benutzernamen suchen

# searchUserNamePreview
source: To protect you and other twonly users from spam and abuse, it is not possible to search for other people in preview mode. Other users can find you and their requests will be displayed here!
de: Um dich und andere twonly Benutzer vor Spam und Missbrauch zu schützen, ist es nicht möglich, im Preview-Modus nach anderen Personen zu suchen. Andere Benutzer können dich finden und deren Anfragen werden dann hier angezeigt!

source: Select subscription
de: Abo auswählen

# searchUsernameNotFound
source: Username not found
de: Benutzername nicht gefunden

# searchUsernameNotFoundBody
source: There is no user with the username "{username}" registered
de: Es wurde kein Benutzer mit dem Benutzernamen "{username}" gefunden.

# searchUsernameNewFollowerTitle
source: Follow requests
de: Folgeanfragen

# searchUsernameQrCodeBtn
source: Scan QR code
de: QR-Code scannen

# searchUserNamePending
source: Pending
de: Ausstehend

# searchUserNameBlockUserTooltip
source: Block the user without informing.
de: Benutzer ohne Benachrichtigung blockieren.

# searchUserNameRejectUserTooltip
source: Reject the request and let the requester know.
de: Die Anfrage ablehnen und den Anfragenden informieren.

# searchUserNameArchiveUserTooltip
source: Archive the user. He will appear again as soon as he accepts your request.
de: Benutzer archivieren. Du wirst informiert sobald er deine Anfrage akzeptiert.

source: User found
de: Benutzer gefunden

# userFoundBody
source: Do you want to create a follow request?
de: Möchtest du eine Folgeanfrage stellen?

# chatListViewSearchUserNameBtn
source: Add your first twonly contact!
de: Füge deinen ersten twonly-Kontakt hinzu!

# chatListViewSendFirstTwonly
source: Send your first twonly!
de: Sende dein erstes twonly!

# chatListDetailInput
source: Type a message
de: Nachricht eingeben

# userDeletedAccount
source: The user has deleted its account.
de: Der Nutzer hat sein Konto gelöscht.

# contextMenuUserProfile
source: User profile
de: Userprofil

# contextMenuVerifyUser
source: Verify
de: Verifizieren

# contextMenuArchiveUser
source: Archive
de: Archivieren

# contextMenuUndoArchiveUser
source: Undo archiving
de: Archivierung aufheben

# startNewChatTitle
source: Select Contact
de: Kontakt wählen

# startNewChatNewContact
source: New Contact
de: Neuer Kontakt

# startNewChatYourContacts
source: Your Contacts
de: Deine Kontakte

# contextMenuOpenChat
source: Open chat
de: Chat

# contextMenuPin
source: Pin
de: Anheften

# contextMenuUnpin
source: Unpin
de: Lösen

# mediaViewerAuthReason
source: Please authenticate to see this twonly!
de: Bitte authentifiziere dich, um diesen twonly zu sehen!

# mediaViewerTwonlyTapToOpen
source: Tap to open your twonly!
de: Tippe um den twonly zu öffnen!

# messageSendState_Received
source: Received
de: Empfangen

# messageSendState_Opened
source: Opened
de: Geöffnet

# messageSendState_Send
source: Sent
de: Gesendet

# messageSendState_Sending
source: Sending
de: Wird gesendet

# messageSendState_TapToLoad
source: Tap to load
de: Tippe zum Laden

# messageSendState_Loading
source: Downloading
de: Herunterladen

# messageStoredInGallery
source: Stored in gallery
de: Gespeichert

# messageReopened
source: Re-opened
de: Erneut geöffnet

# imageEditorDrawOk
source: Take drawing
de: Zeichnung machen

# settingsTitle
source: Settings
de: Einstellungen

# settingsStorageData
source: Data and storage
de: Daten und Speicher

# settingsStorageDataStoreInGTitle
source: Store in Gallery
de: In der Galerie speichern

# settingsStorageDataStoreInGSubtitle
source: Store saved images additional in the systems gallery.
de: Speichere Bilder zusätzlich in der Systemgalerie.

# settingsStorageDataMediaAutoDownload
source: Media auto-download
de: Automatischer Mediendownload

# settingsStorageDataAutoDownMobile
source: When using mobile data
de: Bei Nutzung mobiler Daten

# settingsStorageDataAutoDownWifi
source: When using WI-FI
de: Bei Nutzung von WLAN

# settingsPreSelectedReactions
source: Preselected reaction emojis
de: Vorgewählte Reaktions-Emojis

# settingsPreSelectedReactionsError
source: A maximum of 12 reactions can be selected.
de: Es können maximal 12 Reaktionen ausgewählt werden.

# settingsProfile
source: Profile
de: Profil

# settingsProfileCustomizeAvatar
source: Customize your avatar
de: Avatar anpassen

# settingsProfileEditDisplayName
source: Displayname
de: Anzeigename

# settingsProfileEditDisplayNameNew
source: New Displayname
de: Neuer Anzeigename

# settingsSubscription
source: Subscription
de: Abonnement

# settingsAppearance
source: Appearance
de: Erscheinungsbild

# settingsPrivacy
source: Privacy
de: Datenschutz

# settingsPrivacyBlockUsers
source: Block users
de: Benutzer blockieren

# settingsPrivacyBlockUsersDesc
source: Blocked users will not be able to communicate with you. You can unblock a blocked user at any time.
de: Blockierte Benutzer können nicht mit dir kommunizieren. Du kannst einen blockierten Benutzer jederzeit wieder entsperren.

# settingsPrivacyBlockUsersCount
source: {len} contact(s)
de: {len} Kontakt(e)

# settingsNotification
source: Notification
de: Benachrichtigung

# settingsNotifyTroubleshooting
source: Troubleshooting
de: Fehlersuche

# settingsNotifyTroubleshootingDesc
source: Click here if you have problems receiving push notifications.
de: Hier klicken, wenn Probleme beim Empfang von Push-Benachrichtigungen auftreten.

# settingsNotifyTroubleshootingNoProblem
source: No problem detected
de: Kein Problem festgestellt

# settingsNotifyTroubleshootingNoProblemDesc
source: Press OK to receive a test notification. When you receive no message even after waiting for 10 minutes, please send us your debug log in Settings > Help > Debug log, so we can look at that issue.
de: Klicke auf OK, um eine Testbenachrichtigung zu erhalten. Wenn du auch nach 10 Minuten warten keine Nachricht erhältst, sende uns bitte dein Diagnoseprotokoll unter Einstellungen > Hilfe > Diagnoseprotokoll, damit wir uns das Problem ansehen können.

# settingsHelp
source: Help
de: Hilfe

# feedbackTooltip
source: Give Feedback to improve twonly.
de: Feedback zur Verbesserung von twonly geben.

# settingsHelpContactUs
source: Contact us
de: Kontaktiere uns

# contactUsFaq
source: Have you read our FAQ yet?
de: FAQ schon gelesen?

# contactUsEmojis
source: How do you feel? (optional)
de: Wie fühlst du dich? (optional)

# contactUsSelectOption
source: Please select an option
de: Bitte wähle eine Option

# contactUsReason
source: Tell us why you're reaching out
de: Sag uns, warum du uns kontaktierst

# contactUsMessage
source: If you want to receive an answer, please add your e-mail address so we can contact you.
de: Wenn du eine Antwort erhalten möchtest, füge bitte deine E-Mail-Adresse hinzu, damit wir dich kontaktieren können.

# contactUsYourMessage
source: Your message
de: Deine Nachricht

# contactUsMessageTitle
source: Tell us what's going on
de: Erzähl uns, was los ist

# contactUsReasonNotWorking
source: Something's not working
de: Etwas funktioniert nicht

# contactUsReasonFeatureRequest
source: Feature request
de: Funktionsanfrage

# contactUsReasonQuestion
source: Question
de: Frage

# contactUsReasonOther
source: Other
de: Sonstiges

# contactUsIncludeLog
source: Include debug log
de: Debug-Protokoll anhängen.

# contactUsWhatsThat
source: What's that?
de: Was ist das?

# contactUsLastWarning
source: This are the information's which will be send to us. Please verify them and then press submit.
de: Dies sind die Informationen, die an uns gesendet werden. Bitte prüfen Sie sie und klicke dann auf „Abschicken“.

# contactUsSuccess
source: Feedback submitted successfully!
de: Feedback erfolgreich übermittelt!

# contactUsShortcut
source: Hide Feedback Icon
de: Feedback-Symbol ausblenden

# settingsHelpDiagnostics
source: Diagnostic protocol
de: Diagnoseprotokoll

# settingsHelpLicenses
source: Licenses (Source-Code)
de: Lizenzen (Source-Code)

# settingsHelpCredits
source: Licenses (Images)
de: Lizenzen (Bilder)

# settingsHelpImprint
source: Imprint & Privacy Policy
de: Impressum & Datenschutzrichtlinie

# settingsHelpTerms
source: Terms of Service
de: Nutzungsbedingungen

# settingsAccountDeleteAccount
source: Delete account
de: Konto löschen

# settingsAccountDeleteAccountWithBallance
source: In the next step, you can select what you want to to with the remaining credit ({credit}).
de: Im nächsten Schritt kannst du auswählen, was du mit dem Restguthaben ({credit}) machen willst.

# settingsAccountDeleteAccountNoInternet
source: An Internet connection is required to delete your account.
de: Zum Löschen deines Accounts ist eine Internetverbindung erforderlich.

# settingsAccountDeleteAccountNoBallance
source: Once you delete your account, there is no going back.
de: Wenn du dein Konto gelöscht hast, gibt es keinen Weg zurück.

# settingsAccountDeleteModalTitle
source: Are you sure?
de: Bist du sicher?

# settingsAccountDeleteModalBody
source: Your account will be deleted. There is no change to restore it.
de: Dein Konto wird gelöscht. Es gibt keine Möglichkeit, es wiederherzustellen.

# contactVerifyNumberTitle
source: Verify safety number
de: Sicherheitsnummer verifizieren

# contactVerifyNumberTapToScan
source: Tap to scan
de: Zum Scannen tippen

# contactVerifyNumberMarkAsVerified
source: Mark as verified
de: Als verifiziert markieren

# contactVerifyNumberClearVerification
source: Clear verification
de: Verifizierung aufheben

# contactVerifyNumberLongDesc
source: To verify the end-to-end encryption with {username}, compare the numbers with their device. The person can also scan your code with their device.
de: Um die Ende-zu-Ende-Verschlüsselung mit {username} zu verifizieren, vergleiche die Zahlen mit ihrem Gerät. Die Person kann auch deinen Code mit ihrem Gerät scannen.

# contactNickname
source: Nickname
de: Spitzname

# contactNicknameNew
source: New nickname
de: Neuer Spitzname

# contactBlock
source: Block
de: Blockieren

# contactRemove
source: Remove user
de: Benutzer löschen

# contactRemoveTitle
source: Remove {username}
de: {username} löschen?

# contactRemoveBody
source: Remove the user and permanently delete the chat and all associated media files. This will also delete YOUR ACCOUNT FROM YOUR CONTACT'S PHONE.
de: Entferne den Benutzer und lösche den Chat sowie alle zugehörigen Mediendateien dauerhaft. Dadurch wird auch DEIN KONTO VON DEM TELEFON DEINES KONTAKTS gelöscht.

# deleteAllContactMessages
source: Delete all text-messages
de: Textnachrichten löschen

# deleteAllContactMessagesBody
source: This will remove all messages, except stored media files, in your chat with {username}. This will NOT delete the messages stored at {username}s device!
de: Dadurch werden alle Nachrichten, ausgenommen gespeicherte Mediendateien, in deinem Chat mit {username} gelöscht. Dies löscht NICHT die auf dem Gerät von {username} gespeicherten Nachrichten!

# contactBlockTitle
source: Block {username}
de: Blockiere {username}

# contactBlockBody
source: A blocked user will no longer be able to send you messages and their profile will be hidden from view. To unblock a user, simply navigate to Settings > Privacy > Blocked Users.
de: Ein blockierter Benutzer kann dir keine Nachrichten mehr senden, und sein Profil ist nicht mehr sichtbar. Um die Blockierung eines Benutzers aufzuheben, navigiere einfach zu Einstellungen > Datenschutz > Blockierte Benutzer.

source: Undo
de: Rückgängig

source: Redo
de: Wiederholen

source: Next
de: Weiter

source: Submit
de: Abschicken

source: Close
de: Schließen

source: Cancel
de: Abbrechen

source: Edit
de: Bearbeiten

source: Now
de: Jetzt

source: You
de: Du

source: Image
de: Bild

source: React
de: Reagieren

source: Reply
de: Antworten

source: Copy
de: Kopieren

source: Delete
de: Löschen

source: Disable
de: Deaktiviern

source: Enable
de: Aktivieren

# switchFrontAndBackCamera
source: Switch between front and back camera.
de: Zwischen Front- und Rückkamera wechseln.

# protectAsARealTwonly
source: Send as real twonly!
de: Als echtes twonly senden!

# addDrawing
source: Drawing
de: Zeichnung

# toggleFlashLight
source: Toggle the flash light
de: Taschenlampe umschalten

# toggleHighQuality
source: Toggle better resolution
de: Bessere Auflösung umschalten

# searchUsernameNotFoundLong
source: "{username}" is not a twonly user. Please check the username and try again.
de: "{username}" ist kein twonly-Benutzer. Bitte überprüfe den Benutzernamen und versuche es erneut.

# errorUnknown
source: An unexpected error has occurred. Please try again later.
de: Ein unerwarteter Fehler ist aufgetreten. Bitte versuche es später erneut.

# errorBadRequest
source: The request could not be understood by the server due to malformed syntax. Please check your input and try again.
de: Die Anfrage konnte vom Server aufgrund einer fehlerhaften Syntax nicht verstanden werden. Bitte überprüfe deine Eingabe und versuche es erneut.

# errorTooManyRequests
source: You have made too many requests in a short period. Please wait a moment before trying again.
de: Du hast in kurzer Zeit zu viele Anfragen gestellt. Bitte warte einen Moment, bevor du es erneut versuchst.

# errorInternalError
source: The server is currently not available. Please try again later.
de: Der Server ist derzeit nicht verfügbar. Bitte versuche es später erneut.

# errorInvalidInvitationCode
source: The invitation code you provided is invalid. Please check the code and try again.
de: Der von dir angegebene Einladungscode ist ungültig. Bitte überprüfe den Code und versuche es erneut.

# errorUsernameAlreadyTaken
source: The username you want to use is already taken. Please choose a different username.
de: Der Benutzername, den du verwenden möchtest, ist bereits vergeben. Bitte wähle einen anderen Benutzernamen.

# errorSignatureNotValid
source: The provided signature is not valid. Please check your credentials and try again.
de: Die bereitgestellte Signatur ist nicht gültig. Bitte überprüfe deine Anmeldeinformationen und versuche es erneut.

# errorUsernameNotFound
source: The username you entered does not exist. Please check the spelling or create a new account.
de: Der eingegebene Benutzername existiert nicht. Bitte überprüfe die Schreibweise oder erstelle ein neues Konto.

# errorUsernameNotValid
source: The username you provided does not meet the required criteria. Please choose a valid username.
de: Der von dir angegebene Benutzername entspricht nicht den erforderlichen Kriterien. Bitte wähle einen gültigen Benutzernamen.

# errorInvalidPublicKey
source: The public key you provided is invalid. Please check the key and try again.
de: Der von dir angegebene öffentliche Schlüssel ist ungültig. Bitte überprüfe den Schlüssel und versuche es erneut.

# errorSessionAlreadyAuthenticated
source: You are already logged in. Please log out if you want to log in with a different account.
de: Du bist bereits angemeldet. Bitte melde dich ab, wenn du dich mit einem anderen Konto anmelden möchtest.

# errorSessionNotAuthenticated
source: Your session is not authenticated. Please log in to continue.
de: Deine Sitzung ist nicht authentifiziert. Bitte melde dich an, um fortzufahren.

# errorOnlyOneSessionAllowed
source: Only one active session is allowed per user. Please log out from other devices to continue.
de: Es ist nur eine aktive Sitzung pro Benutzer erlaubt. Bitte melde dich von anderen Geräten ab, um fortzufahren.

# upgradeToPaidPlan
source: Upgrade to a paid plan.
de: Upgrade auf einen kostenpflichtigen Plan.

# upgradeToPaidPlanButton
source: Upgrade subscription to {planId}
de: Auf {planId} upgraden

# partOfPaidPlanOf
source: You are part of the paid plan of {username}!
de: Du bist Teil des bezahlten Plans von {username}!

# errorNotEnoughCredit
source: You do not have enough twonly-credit.
de: Du hast nicht genügend twonly-Guthaben.

# errorPlanLimitReached
source: You have reached your plans limit. Please upgrade your plan.
de: Du hast das Limit deines Plans erreicht. Bitte upgrade deinen Plan.

# errorPlanNotAllowed
source: This feature is not available in your current plan.
de: Dieses Feature ist in deinem aktuellen Plan nicht verfügbar.

# errorVoucherInvalid
source: The voucher code you entered is not valid.
de: Der eingegebene Gutschein-Code ist nicht gültig.

# errorPlanUpgradeNotYearly
source: The plan upgrade must be paid for annually, as the current plan is also billed annually.
de: Das Upgrade des Plans muss jährlich bezahlt werden, da der aktuelle Plan ebenfalls jährlich abgerechnet wird.

# proFeature1
source: ✓ Unlimited media file uploads
de: ✓ Unbegrenzte Medien-Datei-Uploads

# proFeature2
source: 1 additional Plus user
de: 1 zusätzlicher Plus Benutzer

# proFeature3
source: Cloud-Backup encrypted (coming-soon)
de: Zusatzfunktionen (coming-soon)

# proFeature4
source: Additional features (coming-soon)
de: Cloud-Backup verschlüsselt (coming-soon)

# familyFeature1
source: ✓ All from Pro
de: ✓ Alles von Pro

# familyFeature2
source: 4 additional Plus users
de: 4 zusätzliche Plus Benutzer

# redeemUserInviteCode
source: Or redeem a twonly-Code.
de: Oder löse einen twonly-Code ein.

# freeFeature1
source: 10 Media file uploads per day
de: 10 Medien-Datei-Uploads pro Tag

# plusFeature1
source: ✓ Unlimited media file uploads
de: ✓ Unbegrenzte Medien-Datei-Uploads

# plusFeature2
source: Additional features (coming-soon)
de: Zusatzfunktionen (coming-soon)

# transactionHistory
source: Your transaction history
de: Transaktionshistorie

source: Current balance
de: Dein Guthaben

source: Manage additional users
de: Zusätzliche Benutzer verwalten

# manageSubscription
source: Manage your subscription
de: Abonnement verwalten

source: Next payment
de: Nächste Zahlung

source: Open
de: Offene

source: Buy
de: Kaufen

# createOrRedeemVoucher
source: Buy or redeem voucher
de: Gutschein erstellen oder einlösen

# subscriptionRefund
source: When you upgrade, you will receive a refund of {refund} for your current subscription.
de: Wenn du ein Upgrade durchführst, erhältst du eine Rückerstattung von {refund} für dein aktuelles Abonnement.

# createVoucher
source: Buy voucher
de: Gutschein kaufen

# createVoucherDesc
source: Choose the value of the voucher. The value of the voucher will be deducted from your twonly balance.
de: Wähle den Wert des Gutscheins. Der Wert des Gutschein wird von deinem twonly-Guthaben abgezogen.

source: Redeem voucher
de: Gutschein einlösen

# redeemUserInviteCodeTitle
source: Redeem twonly-Code
de: twonly-Code einlösen
