Repository: twonlyapp/twonly-app
Catalog: lib/src/localization/app_*.arb
Languages: de

# redeemUserInviteCodeSuccess
source: Your plan has been successfully adjusted.
de: Dein Plan wurde erfolgreich angepasst.

source: Voucher created
de: Gutschein wurde erstellt

source: Open vouchers
de: Offene Gutscheine

source: Enter Voucher Code
de: Gutschein Code eingeben

source: Voucher redeemed
de: Gutschein eingelöst

source: Requested vouchers
de: Beantragte Gutscheine

source: Redeemed vouchers
de: Eingelöste Gutscheine

# transactionCash
source: Cash transaction
de: Bargeldtransaktion

# transactionRefund
source: Refund transaction
de: Rückerstattung

# transactionAutoRenewal
source: Automatic renewal
de: Automatische Verlängerung

source: Refund
de: Rückerstattung

# transactionThanksForTesting
source: Thank you for testing
de: Danke fürs Testen

# transactionUnknown
source: Unknown transaction
de: Unbekannte Transaktion

# transactionVoucherCreated
source: Voucher created
de: Gutschein erstellt

# transactionVoucherRedeemed
source: Voucher redeemed
de: Gutschein eingelöst

# checkoutOptions
source: Options
de: Optionen

# checkoutPayYearly
source: Pay yearly
de: Jährlich bezahlen

# checkoutTotal
source: Total
de: Gesamt

source: Select Payment Method
de: Zahlungsmethode auswählen

source: twonly-Credit
de: twonly-Guthaben

# notEnoughCredit
source: You do not have enough credit!
de: Du hast nicht genügend Guthaben!

source: Charge credit
de: Guthaben aufladen

source: Auto renewal
de: Automatische Verlängerung

# autoRenewalDesc
source: You can change this at any time.
de: Du kannst dies jederzeit ändern.

# autoRenewalLongDesc
source: When your subscription expires, you will automatically be downgraded to the Preview plan. If you activate the automatic renewal, please make sure that you have enough credit for the automatic renewal. We will notify you in good time before the automatic renewal.
de: Wenn dein Abonnement ausläuft, wirst du automatisch auf den Preview-Plan zurückgestuft. Wenn du die automatische Verlängerung aktivierst, vergewissere dich bitte, dass du über genügend Guthaben für die automatische Erneuerung verfügst. Wir werden dich rechtzeitig vor der automatischen Erneuerung benachrichtigen.

# planSuccessUpgraded
source: Successfully upgraded your plan.
de: Dein Plan wurde erfolgreich aktualisiert.

# checkoutSubmit
source: Order with a fee.
de: Kostenpflichtig bestellen

# additionalUsersList
source: Your additional users
de: Ihre zusätzlichen Benutzer

# additionalUsersPlusTokens
source: twonly-Codes für "Plus" user
de: twonly-Codes für "Plus"-Benutzer

# additionalUsersFreeTokens
source: twonly-Codes für "Free" user
de: twonly-Codes für "Free"-Benutzer

# planNotAllowed
source: You cannot send media files with your current tariff. Upgrade your plan now to send the media file.
de: In deinem aktuellen Plan kannst du keine Mediendateien versenden. Aktualisiere deinen Plan jetzt, um die Mediendatei zu senden.

# planLimitReached
source: You have reached your plan limit for today. Upgrade your plan now to send the media file.
de: Du hast dein Planlimit für heute erreicht. Aktualisiere deinen Plan jetzt, um die Mediendatei zu senden.

# galleryDelete
source: Delete file
de: Datei löschen

# galleryExport
source: Export to gallery
de: In Galerie exportieren

# galleryExportSuccess
source: Successfully saved in the Gallery.
de: Erfolgreich in der Gallery gespeichert.

# galleryDetails
source: Show details
de: Details anzeigen

# settingsResetTutorials
source: Show tutorials again
de: Tutorials erneut anzeigen

# settingsResetTutorialsDesc
source: Click here to show already displayed tutorials again.
de: Klicke hier, um bereits angezeigte Tutorials erneut anzuzeigen.

# settingsResetTutorialsSuccess
source: Tutorials will be displayed again.
de: Tutorials werden erneut angezeigt.

# tutorialChatListSearchUsersTitle
source: Find Friends and Manage Friend Requests
de: Freunde finden und Freundschaftsanfragen verwalten

# tutorialChatListSearchUsersDesc
source: If you know your friends' usernames, you can search for them here and send a friend request. You will also see all requests from other users that you can accept or block.
de: Wenn du die Benutzernamen deiner Freunde kennst, kannst du sie hier suchen und eine Freundschaftsanfrage senden. Außerdem siehst du hier alle Anfragen von anderen Nutzern, die du annehmen oder blockieren kannst.

# tutorialChatListContextMenuTitle
source: Long press on the contact to open the context menu.
de: Klicke lange auf den Kontakt, um das Kontextmenü zu öffnen.

# tutorialChatListContextMenuDesc
source: With the context menu, you can pin, archive, and perform various actions on your contacts. Simply long press the contact and then move your finger to the desired option or tap directly on it.
de: Mit dem Kontextmenü kannst du deine Kontakte anheften, archivieren und verschiedene Aktionen durchführen. Halte dazu einfach den Kontakt lange gedrückt und bewege dann deinen Finger auf die gewünschte Option oder tippe direkt darauf.

# tutorialChatMessagesVerifyShieldTitle
source: Verify your contacts!
de: Verifiziere deine Kontakte!

# tutorialChatMessagesVerifyShieldDesc
source: twonly uses the Signal protocol for secure end-to-end encryption. When you first contact someone, their public identity key is downloaded. To ensure that this key has not been tampered with by third parties, you should compare it with your friend when you meet in person. Once you have verified the user, you can also enable the twonly mode when sending images and videos.
de: twonly nutzt das Signal-Protokoll für eine sichere Ende-zu-Ende Verschlüsselung. Bei der ersten Kontaktaufnahme wird dafür der öffentliche Identitätsschlüssel von deinem Kontakt heruntergeladen. Um sicherzustellen, dass dieser Schlüssel nicht von Dritten ausgetauscht wurde, solltest du ihn mit deinem Freund vergleichen, wenn ihr euch persönlich trefft. Sobald du den Benutzer verifiziert hast, kannst du auch beim verschicken von Bildern und Videos den twonly-Modus aktivieren.

# tutorialChatMessagesReopenMessageTitle
source: Reopen Images and Videos
de: Bilder und Videos erneut öffnen

# tutorialChatMessagesReopenMessageDesc
source: If your friend has sent you a picture or video with infinite display time, you can open it again at any time until you restart the app. To do this, simply double-click on the message. Your friend will then receive a notification that you have viewed the picture again.
de: Wenn dein Freund dir ein Bild oder Video mit unendlicher Anzeigezeit gesendet hat, kannst du es bis zum Neustart der App jederzeit erneut öffnen. Um dies zu tun, musst du einfach doppelt auf die Nachricht klicken. Dein Freund erhält dann eine Benachrichtigung, dass du das Bild erneut angesehen hast.

# memoriesEmpty
source: As soon as you save pictures or videos, they end up here in your memories.
de: Sobald du Bilder oder Videos speicherst, landen sie hier in deinen Erinnerungen.

# deleteTitle
source: Are you sure?
de: Bist du dir sicher?

# deleteOkBtnForAll
source: Delete for all
de: Für alle löschen

# deleteOkBtnForMe
source: Delete for me
de: Für mich löschen

# deleteImageTitle
source: Are you sure?
de: Bist du dir sicher?

# deleteImageBody
source: The image will be irrevocably deleted.
de: Das Bild wird unwiderruflich gelöscht.

# backupNoticeTitle
source: No backup configured
de: Kein Backup konfiguriert

# backupNoticeDesc
source: If you change or lose your device, no one can restore your account without a backup. Therefore, back up your data.
de: Wenn du dein Gerät wechselst oder verlierst, kann ohne Backup niemand dein Account wiederherstellen. Sichere deshalb deine Daten.

# backupNoticeLater
source: Remind later
de: Später erinnern

# backupNoticeOpenBackup
source: Create backup
de: Backup erstellen

# backupPending
source: Pending
de: Ausstehend

# backupFailed
source: Failed
de: Fehlgeschlagen

# backupSuccess
source: Success
de: Erfolgreich

# backupTwonlySafeDesc
source: Back up your twonly identity, as this is the only way to restore your account if you uninstall the app or lose your phone.
de: Sichere deine twonly-Identität, da dies die einzige Möglichkeit ist, dein Konto wiederherzustellen, wenn du die App deinstallierst oder dein Handy verlierst.

# backupMaxBackupSize
source: max. backup size
de: max. Backup-Größe

# backupStorageRetention
source: Storage retention
de: Speicheraufbewahrung

# backupLastBackupDate
source: Last backup
de: Letztes Backup

# backupLastBackupSize
source: Backup size
de: Backup-Größe

# backupLastBackupResult
source: Result
de: Ergebnis

# deleteBackupTitle
source: Are you sure?
de: Bist du sicher?

# backupNoPasswordRecovery
source: Due to twonly's security system, there is (currently) no password recovery function. Therefore, you must remember your password or, better yet, write it down.
de: Aufgrund des Sicherheitssystems von twonly gibt es (derzeit) keine Funktion zur Wiederherstellung des Passworts. Daher musst du dir dein Passwort merken oder, besser noch, aufschreiben.

# deleteBackupBody
source: Without an backup, you can not restore your user account.
de: Ohne ein Backup kannst du dein Benutzerkonto nicht wiederherstellen.

# backupData
source: Data-Backup
de: Daten-Backup

# backupDataDesc
source: This backup contains besides of your twonly-Identity also all of your media files. This backup will is also encrypted but stored locally. You then have to ensure to manually copy it onto your laptop or device of your choice.
de: Das Daten-Backup enthält neben deiner twonly-Identität auch alle deine Mediendateien. Dieses Backup ist ebenfalls verschlüsselt, wird jedoch lokal gespeichert. Du musst es dann manuell auf deinen Laptop oder ein Gerät deiner Wahl kopieren.

# backupInsecurePassword
source: Insecure password
de: Unsicheres Passwort

# backupInsecurePasswordDesc
source: The chosen password is very insecure and can therefore easily be guessed by attackers. Please choose a secure password.
de: Das gewählte Passwort ist sehr unsicher und kann daher leicht von Angreifern erraten werden. Bitte wähle ein sicheres Passwort.

# backupInsecurePasswordOk
source: Continue anyway
de: Trotzdem fortfahren

# backupInsecurePasswordCancel
source: Try again
de: Erneut versuchen

# backupTwonlySafeLongDesc
source: twonly does not have any central user accounts. A key pair is created during installation, which consists of a public and a private key. The private key is only stored on your device to protect it from unauthorized access. The public key is uploaded to the server and linked to your chosen username so that others can find you. twonly Backup regularly creates an encrypted, anonymous backup of your private key together with your contacts and settings. Your username and chosen password are enough to restore this data on another device.
de: twonly hat keine zentralen Benutzerkonten. Während der Installation wird ein Schlüsselpaar erstellt, das aus einem öffentlichen und einem privaten Schlüssel besteht. Der private Schlüssel wird nur auf deinem Gerät gespeichert, um ihn vor unbefugtem Zugriff zu schützen. Der öffentliche Schlüssel wird auf den Server hochgeladen und mit deinem gewählten Benutzernamen verknüpft, damit andere dich finden können. twonly Backup erstellt regelmäßig ein verschlüsseltes, anonymes Backup deines privaten Schlüssels zusammen mit deinen Kontakten und Einstellungen. Dein Benutzername und das gewählte Passwort reichen aus, um diese Daten auf einem anderen Gerät wiederherzustellen.

# backupSelectStrongPassword
source: Choose a secure password. This is required if you want to restore your twonly Backup.
de: Wähle ein sicheres Passwort. Dies ist erforderlich, wenn du dein twonly Backup wiederherstellen möchtest.

source: Password
de: Passwort

# passwordRepeated
source: Repeat password
de: Passwort wiederholen

# passwordRepeatedNotEqual
source: Passwords do not match.
de: Passwörter stimmen nicht überein.

# backupPasswordRequirement
source: Password must be at least 8 characters long.
de: Das Passwort muss mindestens 8 Zeichen lang sein.

# backupExpertSettings
source: Expert settings
de: Experteneinstellungen

# backupEnableBackup
source: Activate automatic backup
de: Automatische Sicherung aktivieren

# backupOwnServerDesc
source: Save your twonly Backup at twonly or on any server of your choice.
de: Speichere dein twonly Backup auf einem Server deiner Wahl.

# backupUseOwnServer
source: Use server
de: Server verwenden

# backupResetServer
source: Use standard server
de: Standardserver verwenden

# backupTwonlySaveNow
source: Save now
de: Jetzt speichern

# backupChangePassword
source: Change password
de: Password ändern

# inviteFriends
source: Invite your friends
de: Freunde einladen

# inviteFriendsShareBtn
source: Share
de: Teilen

# inviteFriendsShareText
source: Let's switch to twonly: {url}
de: Wechseln wir zu twonly: {url}

# appOutdated
source: Your version of twonly is out of date.
de: Deine Version von twonly ist veraltet.

# appOutdatedBtn
source: Update Now
de: Jetzt aktualisieren.

# doubleClickToReopen
source: Double-click to open again
de: Doppelklicken zum erneuten Öffnen.

source: Retransmission requested
de: Wird erneut versucht.

# testPaymentMethod
source: Thanks for the interest in a paid plan. Currently the paid plans are still deactivated. But they will be activated soon!
de: Vielen Dank für dein Interesse an einem kostenpflichtigen Tarif. Die kostenpflichtigen Pläne sind derzeit noch deaktiviert. Sie werden aber bald aktiviert!

# openChangeLog
source: Open changelog automatically
de: Changelog automatisch öffnen

# reportUserTitle
source: Report {username}
de: Melde {username}

# reportUserReason
source: Reporting reason
de: Meldegrund

source: Report user
de: Benutzer melden

# newDeviceRegistered
source: You have logged in on another device. You have therefore been logged out here.
de: Du hast dich auf einem anderen Gerät angemeldet. Daher wurdest du hier abgemeldet.

# tabToRemoveEmoji
source: Tab to remove
de: Tippen um zu entfernen

# quotedMessageWasDeleted
source: The quoted message has been deleted.
de: Die zitierte Nachricht wurde gelöscht.

# messageWasDeleted
source: Message has been deleted.
de: Nachricht wurde gelöscht.

# messageWasDeletedShort
source: Deleted
de: Gelöscht

# sent
source: Delivered
de: Versendet

# sentTo
source: Delivered to
de: Zugestellt an

source: Received
de: Empfangen

source: Opened
de: Geöffnet

source: Waiting for internet
de: Warten auf Internet

source: Edit history
de: Bearbeitungshistorie

source: Archived chats
de: Archivierte Chats

# durationShortSecond
source: Sec.
de: Sek.

# durationShortHour
source: Hrs.
de: Std

# durationShortDays
source: Days
de: Tagen

source: New group
de: Neue Gruppe

source: Select members
de: Mitglieder auswählen

source: Select group name
de: Gruppennamen wählen

# groupNameInput
source: Group name
de: Gruppennamen

# groupMembers
source: Members
de: Mitglieder

source: Create group
de: Gruppe erstellen

source: Add member
de: Mitglied hinzufügen

source: Leave group
de: Gruppe verlassen

source: Create contact request
de: Kontaktanfrage erstellen

source: Make admin
de: Zum Admin machen

# removeAdmin
source: Remove as admin
de: Als Admin entfernen

source: Remove from group
de: Aus Gruppe entfernen

# revokeAdminRightsTitle
source: Revoke {username}'s admin rights?
de: Adminrechte von {username} entfernen?

# revokeAdminRightsOkBtn
source: Remove as admin
de: Als Admin entfernen

# makeAdminRightsTitle
source: Make {username} an admin?
de: {username} zum Admin machen?

# makeAdminRightsBody
source: {username} will be able to edit this group and its members.
de: {username} wird diese Gruppe und ihre Mitglieder bearbeiten können.

# makeAdminRightsOkBtn
source: Make admin
de: Zum Admin machen

source: Update group
de: Gruppe aktualisieren

source: Already in Group
de: Bereits Mitglied

# removeContactFromGroupTitle
source: Remove {username} from this group?
de: {username} aus dieser Gruppe entfernen?

# youChangedGroupName
source: You have changed the group name to "{newGroupName}".
de: Du hast den Gruppennamen zu „{newGroupName}“ geändert.

# makerChangedGroupName
source: {maker} has changed the group name to "{newGroupName}".
de: {maker} hat den Gruppennamen zu „{newGroupName}“ geändert.

# youCreatedGroup
source: You have created the group.
de: Du hast die Gruppe erstellt.

# makerCreatedGroup
source: {maker} has created the group.
de: {maker} hat die Gruppe erstellt.

# youRemovedMember
source: You have removed {affected} from the group.
de: Du hast {affected} aus der Gruppe entfernt.

# makerRemovedMember
source: {maker} has removed {affected} from the group.
de: {maker} hat {affected} aus der Gruppe entfernt.

# youAddedMember
source: You have added {affected} to the group.
de: Du hast {affected} zur Gruppe hinzugefügt.

# makerAddedMember
source: {maker} has added {affected} to the group.
de: {maker} hat {affected} zur Gruppe hinzugefügt.

# youMadeAdmin
source: You made {affected} an admin.
de: Du hast {affected} zum Administrator gemacht.

# makerMadeAdmin
source: {maker} made {affected} an admin.
de: {maker} hat {affected} zum Administrator gemacht.

# youRevokedAdminRights
source: You revoked {affectedR} admin rights.
de: Du hast {affectedR} die Administratorrechte entzogen.

# makerRevokedAdminRights
source: {maker} revoked {affectedR} admin rights.
de: {maker} hat {affectedR} die Administratorrechte entzogen.

# youLeftGroup
source: You have left the group.
de: Du hast die Gruppe verlassen.

# makerLeftGroup
source: {maker} has left the group.
de: {maker} hat die Gruppe verlassen.

# groupActionYou
source: you
de: dich

# groupActionYour
source: your
de: deine

# twonlySafeRecoverDesc
source: If you have created a backup with twonly Backup, you can restore it here.
de: Wenn du ein Backup mit twonly Backup erstellt hast, kannst du es hier wiederherstellen.

# twonlySafeRecoverBtn
source: Restore backup
de: Backup wiederherstellen

# notificationText
source: sent a message{inGroup}.
de: hat eine Nachricht{inGroup} gesendet.

# notificationTwonly
source: sent a twonly{inGroup}.
de: hat ein twonly{inGroup} gesendet.

# notificationVideo
source: sent a video{inGroup}.
de: hat ein Video{inGroup} gesendet.

# notificationImage
source: sent a image{inGroup}.
de: hat ein Bild{inGroup} gesendet.

# notificationAddedToGroup
source: has added you to "{groupname}"
de: hat dich zu "{groupname}" hinzugefügt.

# notificationContactRequest
source: wants to connect with you.
de: möchte sich mit dir vernetzen.

# notificationAcceptRequest
source: is now connected with you.
de: ist jetzt mit dir vernetzt.

# notificationStoredMediaFile
source: has stored your image.
de: hat dein Bild gespeichert.

# notificationReaction
source: has reacted to your image.
de: hat auf dein Bild reagiert.

# notificationReopenedMedia
source: has reopened your image.
de: hat dein Bild erneut geöffnet.

# notificationReactionToVideo
source: has reacted with {reaction} to your video.
de: hat mit {reaction} auf dein Video reagiert.

# notificationReactionToText
source: has reacted with {reaction} to your message.
de: hat mit {reaction} auf deine Nachricht reagiert.

# notificationReactionToImage
source: has reacted with {reaction} to your image.
de: hat mit {reaction} auf dein Bild reagiert.

# notificationResponse
source: has responded{inGroup}.
de: hat dir{inGroup} geantwortet.

# notificationTitleUnknownUser
source: Someone
de: Jemand

# notificationCategoryMessageTitle
source: Messages
de: Nachrichten

# notificationCategoryMessageDesc
source: Messages from other users.
de: Nachrichten von anderen Benutzern.
